#include "flight.h"

char *admin = "zxf";
char *password = "1234";

void Menu_interface(struct node* head_flight,struct node_pasger* head_pasger);
void Admin_interface(struct node* head_flight,struct node_pasger* head_pasger);
void User_interface(struct node* head_flight,struct node_pasger* head_pasger);
/******************flight************************/
void Add_flight(struct node *head_flight);
void Delete_flight(struct node* head_flight);
void Modity_flight(struct node* head_flight);
void Check_flight(struct node* head_flight);
void Show_flight(struct node* head_flight);
void Show_pasger(struct node_pasger* head_pasger);
/******************flight************************/

/*******************pasger*****************************/
int Seat_show(struct node_pasger* head_pasger,char* number);
void Book_ticket(struct node* head_flight,struct node_pasger* head_pasger);
void Ticket_changing(struct node* head_flight,struct node_pasger* head_pasger);
void Refund_ticket(struct node_pasger* head_pasger);
void Check_ticket(struct node_pasger* head_pasger);
/**********************pasger**********************/

/*===========================RW file init================================
 *  mode : 1 is to w ,2 is to r
 =============================RW file init=================================*/

void RW_file_init(struct node *flight_head,struct node_pasger *pasger_head,int mode);

/****************************************************/

/******************线程清理**************************/
typedef struct thread_data{
	struct node* head_flight;
	struct node_pasger* head_pasger;
}thread_data;

void *my_Thread(void *arg)
{
	while(1){
		thread_data *tdata = (thread_data *)arg;
		Remind_pasger(tdata->head_pasger);
		Clean(tdata->head_flight,tdata->head_pasger);
		//pthread_exit(NULL);
		sleep(3);
	}
}

/***********************线程清理*******************/

int main(void)
{
#if 1

	struct node *head_flight;
	struct node_pasger *head_pasger;
	(void)Init_head_flight(&head_flight);
	(void)Init_head_pasger(&head_pasger);
	/****************读文件信息********************/
	RW_file_init(head_flight,head_pasger,2);
	/****************线程自动清理***********************/
	pthread_t tid;
	thread_data tdata;
	tdata.head_flight = head_flight;
	tdata.head_pasger = head_pasger;
	pthread_create(&tid,NULL,my_Thread,(void*)&tdata);
	/****************线程自动清理***********************/
	//pthread_join(tid,NULL);
	/***************************************/
	Show(250000);
	printf("初始化中..................\n");
	//(void)Create_list_flight(head_flight);
	//(void)Traverse_flight(head_flight,0);
	//(void)Traverse_flight(head_flight,1);
	//int seat;
	//seat=Seat_show(head_pasger,"5");
	//printf("your choose seat is %d\n",seat);

	sleep(1);
	while(1){
		system("clear");
		Menu_interface(head_flight,head_pasger);
		char mode;
		printf(LIGHT_CYAN"**  请输入您的要进入的模式："NONE);
		while(1){	
			scanf("%c",&mode);
			getchar();
			if( '3'>= mode && mode >='1')
				break;
			printf("输入错误，请重新输入！\n");
			printf(LIGHT_CYAN"**                                    温馨提示   ：  您输入有误，请重新输入，谢谢    ^~^  ^~^ ^~^                                                        **\n"NONE);
			printf(LIGHT_CYAN"**  请输入您的要进入的模式："NONE);
		}
		switch(mode){
			case '1':
				Admin_interface(head_flight,head_pasger);
				;break;
			case '2':
				User_interface(head_flight,head_pasger);
				;break;
			case '3':
				RW_file_init(head_flight,head_pasger,1);
				exit(0);
				;break;
			default:
				printf(LIGHT_CYAN"**                                    温馨提示   ：  您输入有误，请重新输入，谢谢    ^~^  ^~^ ^~^                                                        **\n"NONE);
				;
		}//end switch
	}//end while
	/****************线程自动清理***********************/
	pthread_join(tid,NULL);
	/****************线程自动清理***********************/
	printf("traverse \n");
#endif
	return 0;
}
void Menu_interface(struct node* head_flight,struct node_pasger* head_pasger)
{
	/***************************************************航班表图形登录界面设计**********************************************************************/
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	printf(LIGHT_CYAN"*******************************************************************中国航班系统****************************************************************************\n"NONE);
	printf(LIGHT_CYAN"**************************************************************Wecome to airline system*********************************************************************\n"NONE);
#if 0
	printf(LIGHT_CYAN"**                                                 温馨提示：请选择登录模式；                                                                            **\n"NONE);
	printf(LIGHT_BLUE"**                                               1.输入1进入管理员模式；                                                                                 **\n"NONE);
	printf(LIGHT_BLUE"**                                               2.输入2进入用户模式；                                                                                   **\n"NONE);
	printf(LIGHT_BLUE"**                                               3.输入3进入退出系统；                                                                                   **\n"NONE);
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
#endif

#if 1
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
	printf(LIGHT_CYAN"**********                             ..  .                    .. .         ..                      ...            ..  .                                  \n"NONE);
	printf(LIGHT_CYAN"**********                              .                   ..  .             .   E##D            ..  .              .                                     \n"NONE);
	printf(LIGHT_CYAN"**********                               .                  ..                  ##i  #W.          ..                  .                                    \n"NONE);
	printf(LIGHT_CYAN"**********                                                .                    WE     ##        . .                                                        \n"NONE);
	printf(LIGHT_CYAN"**********                                                   .                #        W           .                                                       \n"NONE);
	printf(LIGHT_CYAN"**********                                                                   ######    ##                                                                  \n"NONE);
	printf(LIGHT_CYAN"**********                                                                 #W##W#    ####                                                                  \n"NONE);
	printf(LIGHT_CYAN"**********                                      .                         W        KKW.Wf                                  .                               \n"NONE);
	printf(LIGHT_CYAN"**********                                   ... .                      #i         ...G#                                WKWW# .                            \n"NONE);
	printf(LIGHT_CYAN"**********                                .                   ..   .  W      .#W#    .K             ..   .          .# W     W                             \n"NONE);
	printf(LIGHT_CYAN"**********                                 .                    .    ####W##G    #WL ##            .. .             #t# .    W                             \n"NONE);
	printf(LIGHT_CYAN"**********                             . .             ,W########G: ##      ##W#   ##WE           ...         ###   # W      K                             \n"NONE);
	printf(LIGHT_CYAN"**********                                         ####i  .   ..  i###W##D      #W#  W          . . ..       W :#W## #L      #                             \n"NONE);
	printf(LIGHT_CYAN"**********                                       ##G     ... .          :###W##;   ##W           . .         #W#, K# W      ##                             \n"NONE);
	printf(LIGHT_BLUE"**********                                     ##        中国航班系统  .       t######D.         .           #    # EG      W                              \n"NONE);
	printf(LIGHT_BLUE"**********                                    ##   Wecome to airline system           f###WW####E;           W   .# #      .#                              \n"NONE);
	printf(LIGHT_CYAN"**********                                   #K                                                  :jK######WWWW#### G#      #E                              \n"NONE);
	printf(LIGHT_GRAY"**********                                 ##WEW:   温馨提示：请选择登录模式：                                  #  #      K#                               \n"NONE);
	printf(LIGHT_CYAN"**********                                 ##; #K#                                                                        #                                \n"NONE);
	printf(LIGHT_GREEN"**********                                #:#   .#W##.          1.输入1进入管理员模式；                                   #                                \n"NONE);
	printf(LIGHT_GREEN"**********                               ###.    . .j#K         2.输入2进入用户模式；                                     #.  .                            \n"NONE);
	printf(LIGHT_GREEN"**********                              L#G#W,.       K#        3.输入3进入退出系统；                  .                 # .                               \n"NONE);
	printf(LIGHT_CYAN"**********                              Ki#.;W#i    .#K                                               . .               .# .                               \n"NONE);
	printf(LIGHT_CYAN"**********                             ##, .                 . WWE;    ;K##WK##. .                 .             W# ... . #.                               \n"NONE);
	printf(LIGHT_CYAN"**********                               ##               .  ##                 #W              ..  .##W#EK##E      ##GWt GW##                             \n"NONE);
	printf(LIGHT_CYAN"**********                                 #W##              L#                 #W#####WWW#######WW##t                #W#,    #                            \n"NONE);
	printf(LIGHT_CYAN"**********                                   #######G:      :fK                 KW##WW####Wj.                          ;W#    #                            \n"NONE);
	printf(LIGHT_CYAN"**********                                     #W#;:D########EW                fW#                                       ####K;                            \n"NONE);
	printf(LIGHT_CYAN"**********                                     .               KW##j.  ,G##W#tW#   . .                                     ..                              \n"NONE);
	printf(LIGHT_CYAN"**********                             ..                      K;.           W#  .                    ..            ..  .                                  \n"NONE);
	printf(LIGHT_CYAN"**********                              .  .                 . WL            W   .                 .  .              .  .                                  \n"NONE);
	printf(LIGHT_CYAN"**********                                                     ##     j##W#LK                                                                              \n"NONE);
	printf(LIGHT_CYAN"**********                                  ...  .              W          W      ...  .                                  ..  .                            \n"NONE);
	printf(LIGHT_CYAN"**********                                 .  .                 #.        ##     .  .                                  ..  .                               \n"NONE);
	printf(LIGHT_CYAN"**********                                ....                   #.       K     ....                    .               ...                                \n"NONE);
	printf(LIGHT_CYAN"**********                                .                    . #L.     W#   . .                   ..   .             .                                   \n"NONE);
	printf(LIGHT_CYAN"**********                              .  .                  . . K     ##    .  .                  . .              .  .                                  \n"NONE);
	printf(LIGHT_CYAN"**********                             . .                  ...    W###K#    . .                  ...               . .                                    \n"NONE);
	printf(LIGHT_CYAN"**********                                                .   .     t#ft                        .  ..                                                      \n"NONE);


#endif
}//end menu interface

void Admin_interface(struct node* head_flight,struct node_pasger* head_pasger)
{
	char mode = '0';

	while(1){
		system("clear");
		/***************************************************航班登录判断图形界面设计**********************************************************************/
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_CYAN"*******************************************************************中国航班登录界面************************************************************************\n"NONE);
		printf(LIGHT_CYAN"**************************************************************Wecome to airline system*********************************************************************\n"NONE);
		printf(LIGHT_CYAN"*******************************************************退出请输入在用户名或密码中输入quit!!!!**************************************************************\n"NONE);
		printf(YELLOW"**  请输入您的用户名："NONE);
		char name[20];
		while(1){
			scanf("%s",name);
			getchar();
			if(strlen(name) < 20 && strlen(name) > 0 )
				break;
			printf(RED"输入错误，请重新输入！\n"NONE);
			printf(YELLOW"**  请输入您的用户名："NONE);
		}
		printf(YELLOW"**  请输入您的密  码："NONE);
		char pwd[20];
		while(1){
			scanf("%s",pwd);
			getchar();
			if(strlen(pwd) < 18 && strlen(pwd) > 0 )
				break;
			printf(RED"输入错误，请重新输入！\n"NONE);
			printf(YELLOW"**  请输入您的密  码："NONE);
		}
		if(strcmp(name,"quit") == 0 || strcmp(pwd,"quit") == 0){
			break;
		}

		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);

		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_CYAN"*******************************************************************中国航班********************************************************************************\n"NONE);
		printf(LIGHT_CYAN"**************************************************************校验密码中..............*********************************************************************\n"NONE);
		sleep(1);
		if(strcmp(name,admin) == 0 && strcmp(pwd,password) == 0){
			while(1){
				system("clear");
				/***************************************************航班管理员图形界面设计**********************************************************************/
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"*******************************************************************中国航班管理员模式**********************************************************************\n"NONE);
				printf(LIGHT_CYAN"**************************************************************Wecome to airline system*********************************************************************\n"NONE);
				printf(LIGHT_BLUE"**                                                     1.添加航班信息                                                                                    **\n"NONE);
				printf(LIGHT_BLUE"**                                                     2.删除航班信息                                                                                    **\n"NONE);
				printf(LIGHT_BLUE"**                                                     3.更改航班信息                                                                                    **\n"NONE);
				printf(LIGHT_BLUE"**                                                     4.查询航班信息                                                                                    **\n"NONE);
				printf(LIGHT_BLUE"**                                                     5.查看乘客信息                                                                                    **\n"NONE);
				printf(LIGHT_BLUE"**                                                     6.显示航班                                                                                        **\n"NONE);				
				printf(LIGHT_RED"**                                                     7.退出                                                                                            **\n"NONE);								
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_GREEN"**************************************************************温馨提示已进入管理员模式*********************************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	

				printf(LIGHT_GRAY"**  请输入您的要进入的模式："NONE);
				while(1){
					scanf("%c",&mode);
					getchar();
					if(mode < '8' && mode> '0')
						break;
					printf(RED"输入错误，请重新输入！\n"NONE);
					printf(LIGHT_GRAY"**  请输入您的要进入的模式："NONE);
				}
				if(mode == '7'){
					break;
				}
				switch(mode){
					case '1':
						Add_flight(head_flight);break;
					case '2':
						Delete_flight(head_flight);break;
					case '3':
						Modity_flight(head_flight);break;
					case '4':
						Check_flight(head_flight);break;
					case '5':
						Show_pasger(head_pasger);break;
					case '6':
						Show_flight(head_flight);break;
					default:
						;
				}//end switch mode

			}	//end while for 
		}//end if
		if(mode != '7'){
			printf(LIGHT_CYAN"**                                                                                                                                                       **\n"NONE);
			printf(LIGHT_CYAN"**                                                                                                                                                       **\n"NONE);
			printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
			printf(LIGHT_CYAN"*******************************************************该账号不存在或密码不正确****************************************************************************\n"NONE);
			printf(LIGHT_CYAN"*******************************************************退出请输入在用户名或密码中输入quit!!!!**************************************************************\n"NONE);
			printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);		
			getchar();
		}
	}

}//end Admin_interface

void User_interface(struct node* head_flight,struct node_pasger* head_pasger)
{
	char mode = '0';
	while(1){
		system("clear");
		/***************************************************航班表图形界面设计**********************************************************************/
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_CYAN"*****************************************************************中国航班用户界面**************************************************************************\n"NONE);
		printf(LIGHT_CYAN"**************************************************************Wecome to airline system*********************************************************************\n"NONE);
		printf(LIGHT_GRAY"**                                                     1.订票                                                                                            **\n"NONE);
		printf(LIGHT_GRAY"**                                                     2.改签                                                                                            **\n"NONE);
		printf(LIGHT_GRAY"**                                                     3.退票                                                                                            **\n"NONE);
		printf(LIGHT_GRAY"**                                                     4.查询                                                                                            **\n"NONE);
		printf(LIGHT_RED"**                                                     5.退出                                                                                            **\n"NONE);	
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
		printf(LIGHT_BLUE"**请在以上选择中选择您要进行的操作："NONE);
		mode = '0';
		while(1){
			scanf("%c",&mode);
			getchar();
			printf("%c\n",mode);
			if(mode < '6' && mode> '0')
				break;
			printf("输入错误，请重新输入！\n");
			printf(LIGHT_BLUE"**请在以上选择中选择您要进行的操作："NONE);
		}
		if(mode == '5'){
			break;
		}
		switch(mode){
			case '1':
				Book_ticket(head_flight,head_pasger);break;
			case '2':
				Ticket_changing(head_flight,head_pasger);break;
			case '3':
				Refund_ticket(head_pasger);break;
			case '4':
				Check_ticket(head_pasger);break;
			default:
				;
		}

	}
}//user interface

void Add_flight(struct node *head_flight)
{
	int mode = 0;
	//struct flight input = {"","","","","",0,0,0,0,0,0};
	//struct passenger key = {"",0,input};
	struct flight input;
	memset(&input,0,sizeof(struct flight));
	struct flight key;
	memset(&key,0,sizeof(struct flight));
	while(1){
		system("clear");
		/***************************************************航班管理员图形界面设计**********************************************************************/
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_CYAN"*******************************************************************中国航班管理员模式**********************************************************************\n"NONE);
		printf(LIGHT_CYAN"**************************************************************Wecome to airline system*********************************************************************\n"NONE);
		printf(LIGHT_BLUE"**                                                     1.连续添加航班信息                                                                                **\n"NONE);
		printf(LIGHT_BLUE"**                                                     2.添加单个航班信息                                                                                **\n"NONE);
		printf(LIGHT_BLUE"**                                                     3.指定航班号位置添加单个航班信息                                                                  **\n"NONE);	
		printf(LIGHT_GRAY"**                                                     4.指定起点站位置添加单个航班信息                                                                  **\n"NONE);	
		printf(LIGHT_GRAY"**                                                     5.指定终点位置添加单个航班信息                                                                    **\n"NONE);	
		printf(LIGHT_GRAY"**                                                     6.指定班期位置添加单个航班信息                                                                    **\n"NONE);	
		printf(LIGHT_PURPLE"**                                                     7.指定机型位置添加单个航班信息                                                                    **\n"NONE);			
		printf(LIGHT_PURPLE"**                                                     8.指定起飞时间位置添加单个航班信息                                                                **\n"NONE);					
		printf(LIGHT_PURPLE"**                                                     9.指定到达时间位置添加单个航班信息                                                                **\n"NONE);	
		printf(LIGHT_PURPLE"**                                                     10.指定票价位置添加单个航班信息                                                                    **\n"NONE);	
		printf(LIGHT_RED"**                                                     11.退出                                                                                            **\n"NONE);			
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_BLUE"**************************************************************温馨提示已进入管理员模式*********************************************************************\n"NONE);
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	

		mode = 0;
		printf(LIGHT_GRAY"**  请输入您的要进入的模式："NONE);
		while(1){
			scanf("%d",&mode);
			getchar();
			if(mode < 12 && mode> 0)
				break;
			printf(RED"输入错误，请重新输入！\n"NONE);
			printf(LIGHT_GRAY"**  请输入您的要进入的模式："NONE);
		}
		if(mode == 11){
			break;
		}
		switch(mode){
			case 1:
				(void)Create_list_flight(head_flight);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_GREEN"***************************************************温馨提示:添加成功，已进入管理员模式*********************************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
				getchar();
				break;
			case 2:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_BLUE"**************************************************温馨提示:请输入您要录入的航班信息，已进入管理员模式******************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
				Input_flight_interface(&input);
				(void)Insert_data_flight(head_flight,&input,key,9);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_GREEN"***************************************************温馨提示:添加成功，已进入管理员模式*********************************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
				getchar();
				break;
			case 3:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_GREEN"**************************************************温馨提示:请输入您要录入的航班信息，已进入管理员模式******************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
				Input_flight_interface(&input);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要录入的航班的航班号关键字信息，已进入管理员模式**********************************************\n"NONE);
				printf(LIGHT_RED"***************************************温馨提示:只输入您要录入的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Insert_data_flight(head_flight,&input,key,1);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_BLUE"***************************************************温馨提示:添加成功，已进入管理员模式*********************************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
				getchar();
				break;
			case 4:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"**************************************************温馨提示:请输入您要录入的航班信息，已进入管理员模式******************************************************\n"NONE); 
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
				Input_flight_interface(&input);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要录入的航班的起点站关键字信息，已进入管理员模式**********************************************\n"NONE);
				printf(LIGHT_RED"***************************************温馨提示:只输入您要录入的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Insert_data_flight(head_flight,&input,key,2);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************************温馨提示:添加成功，已进入管理员模式*********************************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
				getchar();
				break;
			case 5:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"**************************************************温馨提示:请输入您要录入的航班信息，已进入管理员模式******************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
				Input_flight_interface(&input);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要录入的航班的终点站关键字信息，已进入管理员模式**********************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要录入的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Insert_data_flight(head_flight,&input,key,3);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_GREEN"***************************************************温馨提示:添加成功，已进入管理员模式*********************************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
				getchar();
				break;
			case 6:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"**************************************************温馨提示:请输入您要录入的航班信息，已进入管理员模式******************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
				Input_flight_interface(&input);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要录入的航班的班期关键字信息，已进入管理员模式************************************************\n"NONE);
				printf(LIGHT_RED"***************************************温馨提示:只输入您要录入的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);				
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Insert_data_flight(head_flight,&input,key,4);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_GREEN"***************************************************温馨提示:添加成功，已进入管理员模式*********************************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
				getchar();
				break;
			case 7:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_BLUE"**************************************************温馨提示:请输入您要录入的航班信息，已进入管理员模式******************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
				Input_flight_interface(&input);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要录入的航班的机型关键字信息，已进入管理员模式************************************************\n"NONE);
				printf(LIGHT_RED"***************************************温馨提示:只输入您要录入的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);				
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Insert_data_flight(head_flight,&input,key,5);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_GREEN"***************************************************温馨提示:添加成功，已进入管理员模式*********************************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
				getchar();
				break;
			case 8:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"**************************************************温馨提示:请输入您要录入的航班信息，已进入管理员模式******************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
				Input_flight_interface(&input);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:请输入您要录入的航班的起飞时间关键字信息，已进入管理员模式*************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要录入的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);				
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Insert_data_flight(head_flight,&input,key,6);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************************温馨提示:添加成功，已进入管理员模式*********************************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
				getchar();
				break;
			case 9:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"**************************************************温馨提示:请输入您要录入的航班信息，已进入管理员模式******************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
				Input_flight_interface(&input);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:请输入您要录入的航班的到达时间关键字信息，已进入管理员模式*************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要录入的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);				
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Insert_data_flight(head_flight,&input,key,7);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************************温馨提示:添加成功，已进入管理员模式*********************************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
				getchar();
				break;
			case 10:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"**************************************************温馨提示:请输入您要录入的航班信息，已进入管理员模式******************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
				Input_flight_interface(&input);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:请输入您要录入的航班的票价关键字信息，已进入管理员模式*****************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要录入的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);				
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Insert_data_flight(head_flight,&input,key,8);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************************温馨提示:添加成功，已进入管理员模式*********************************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
				getchar();
				break;
			default:
				;
		}
	}	//end while for 
}//end add_flight	



void Delete_flight(struct node* head_flight)
{
	int mode = 0;
	//struct flight input = {"","","","","",0,0,0,0,0,0};
	//struct passenger key = {"",0,input};
	//struct flight input;
	//memset(&input,0,sizeof(struct flight));
	struct flight key;
	memset(&key,0,sizeof(struct flight));
	while(1){
		system("clear");
		/***************************************************航班管理员图形界面设计**********************************************************************/
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_CYAN"*******************************************************************中国航班管理员模式**********************************************************************\n"NONE);
		printf(LIGHT_CYAN"**************************************************************Wecome to airline system*********************************************************************\n"NONE);
		printf(LIGHT_GREEN"**                                                     1.指定航班号位置删除单个航班信息                                                                  **\n"NONE);	
		printf(LIGHT_CYAN"**                                                     2.指定起点站位置删除单个航班信息                                                                  **\n"NONE);	
		printf(LIGHT_BLUE"**                                                     3.指定终点位置删除单个航班信息                                                                    **\n"NONE);	
		printf(LIGHT_CYAN"**                                                     4.指定班期位置删除单个航班信息                                                                    **\n"NONE);	
		printf(LIGHT_GRAY"**                                                     5.指定机型位置删除单个航班信息                                                                    **\n"NONE);			
		printf(LIGHT_CYAN"**                                                     6.指定起飞时间位置删除单个航班信息                                                                **\n"NONE);					
		printf(LIGHT_PURPLE"**                                                     7.指定到达时间位置删除单个航班信息                                                                **\n"NONE);	
		printf(LIGHT_CYAN"**                                                     8.指定票价位置删除单个航班信息                                                                    **\n"NONE);	
		printf(LIGHT_RED"**                                                     9.退出                                                                                            **\n"NONE);			
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_CYAN"**************************************************************温馨提示已进入管理员模式*********************************************************************\n"NONE);
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
		printf(LIGHT_BLUE"**请选择您要如何删除："NONE);		
		mode = 0;
		while(1){
			scanf("%d",&mode);
			getchar();
			if(mode < 10 && mode> 0)
				break;
			printf(RED"输入错误，请重新输入！\n"NONE);
			printf(LIGHT_GRAY"**请选择您要如何删除："NONE);
		}
		if(mode == 9){
			break;
		}
		switch(mode){
			case 1:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要删除的航班的航班号关键字信息，已进入管理员模式**********************************************\n"NONE);
				printf(LIGHT_RED"***************************************温馨提示:只输入您要录入的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Delete_data_flight(head_flight,key,1);break;
			case 2:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要删除的航班的起点站关键字信息，已进入管理员模式**********************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要删除的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Delete_data_flight(head_flight,key,2);break;
			case 3:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要删除的航班的终点站关键字信息，已进入管理员模式**********************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要删除的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Delete_data_flight(head_flight,key,3);break;
			case 4:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要删除的航班的班期关键字信息，已进入管理员模式************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要删除的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);				
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Delete_data_flight(head_flight,key,4);break;
			case 5:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要删除的航班的机型关键字信息，已进入管理员模式************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要删除的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);				
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Delete_data_flight(head_flight,key,5);break;
			case 6:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:请输入您要删除的航班的起飞时间关键字信息，已进入管理员模式*************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要删除的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);				
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Delete_data_flight(head_flight,key,6);break;
			case 7:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:请输入您要删除的航班的到达时间关键字信息，已进入管理员模式*************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要删除的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);				
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Delete_data_flight(head_flight,key,7);break;
			case 8:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:请输入您要删除的航班的票价关键字信息，已进入管理员模式*****************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要删除的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);				
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Delete_data_flight(head_flight,key,8);break;
			default:
				;
		}//end switch

	}	//end while for 	

}//end Delete_flight



void Modity_flight(struct node* head_flight)
{
	int mode = 0;
	//struct flight input = {"","","","","",0,0,0,0,0,0};
	//struct passenger key = {"",0,input};
	//struct flight input;
	//memset(&input,0,sizeof(struct flight));
	struct flight key;
	memset(&key,0,sizeof(struct flight));
	while(1){
		system("clear");
		/***************************************************航班管理员图形界面设计**********************************************************************/
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_CYAN"*******************************************************************中国航班管理员模式**********************************************************************\n"NONE);
		printf(LIGHT_CYAN"**************************************************************Wecome to airline system*********************************************************************\n"NONE);
		printf(LIGHT_GRAY"**                                                     1.查找航班号位置修改单个航班信息                                                                  **\n"NONE);	
		printf(LIGHT_CYAN"**                                                     2.查找起点站位置修改单个航班信息                                                                  **\n"NONE);	
		printf(LIGHT_GREEN"**                                                     3.查找终点位置修改单个航班信息                                                                    **\n"NONE);	
		printf(LIGHT_CYAN"**                                                     4.查找班期位置修改单个航班信息                                                                    **\n"NONE);	
		printf(LIGHT_BLUE"**                                                     5.查找机型位置修改单个航班信息                                                                    **\n"NONE);			
		printf(LIGHT_CYAN"**                                                     6.查找起飞时间位置修改单个航班信息                                                                **\n"NONE);					
		printf(LIGHT_PURPLE"**                                                     7.查找到达时间位置修改单个航班信息                                                                **\n"NONE);	
		printf(LIGHT_CYAN"**                                                     8.查找票价位置修改单个航班信息                                                                    **\n"NONE);	
		printf(LIGHT_RED"**                                                     9.退出                                                                                            **\n"NONE);			
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_CYAN"**************************************************************温馨提示已进入管理员模式*********************************************************************\n"NONE);
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
		printf(LIGHT_BLUE"**请选择您要如何修改："NONE);		
		mode = 0;
		while(1){
			scanf("%d",&mode);
			getchar();
			if(mode < 12 && mode> 0)
				break;
			printf("输入错误，请重新输入！\n");
			printf(LIGHT_BLUE"**请选择您要如何修改："NONE);
		}
		if(mode == 9){
			break;
		}
		switch(mode){
			case 1:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要修改的航班的航班号关键字信息，已进入管理员模式**********************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				//Input_flight_interface(&key);

				printf(LIGHT_CYAN"** 请输入航   班   号："NONE);
				while(1){
					scanf("%s",key.number);
					getchar();
					if(strlen(key.number) < 18 && strlen(key.number) > 0 )
						break;
					printf("输入错误，请重新输入！\n");
					printf(LIGHT_CYAN"** 请输入航   班   号："NONE);
				}
				putchar(10);				

				printf(YELLOW"******************************************************************************查找中，请耐心等待....*******************************************************\n"NONE);
				sleep(1);			
				(void)My_replace_flight(head_flight,key,1);break;
			case 2:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要修改的航班的起点站关键字信息，已进入管理员模式**********************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要修改的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				//Input_flight_interface(&key);
				printf(LIGHT_GREEN"** 请输入起   点   站："NONE);
				while(1){
					scanf("%s",key.staddress);
					getchar();
					if(strlen(key.staddress) < 18 && strlen(key.staddress) > 0)
						break;
					printf(RED"输入错误，请重新输入！\n"NONE);
					printf(LIGHT_GREEN"** 请输入起   点   站："NONE);
				}
				putchar(10);
				(void)My_replace_flight(head_flight,key,2);break;
			case 3:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要修改的航班的终点站关键字信息，已进入管理员模式**********************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要修改的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				//Input_flight_interface(&key);
				printf(LIGHT_CYAN"** 请输入终   点   站："NONE);
				while(1){
					scanf("%s",key.arraddress);
					getchar();
					if(strlen(key.arraddress) < 18 && strlen(key.arraddress) > 0)
						break;
					printf("输入错误，请重新输入！\n");
					printf(LIGHT_CYAN"** 请输入终   点   站："NONE);
				}
				putchar(10);				
				(void)My_replace_flight(head_flight,key,3);break;
			case 4:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要修改的航班的班期关键字信息，已进入管理员模式************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要修改的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);				
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				//Input_flight_interface(&key);
				printf(LIGHT_CYAN"** 请输入班        期："NONE);
				while(1){
					scanf("%s",key.DATE);
					getchar();
					if(strlen(key.DATE) < 12 && strlen(key.DATE) > 0)
						break;
					printf("输入错误，请重新输入！\n");
					printf(LIGHT_CYAN"** 请输入班        期："NONE);
				}
				putchar(10);
				(void)My_replace_flight(head_flight,key,4);break;
			case 5:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要修改的航班的机型关键字信息，已进入管理员模式************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要修改的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);				
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				//Input_flight_interface(&key);
				printf(LIGHT_CYAN"** 请输入机        型："NONE);
				while(1){
					scanf("%s",key.TYPE);
					getchar();
					if(strlen(key.TYPE) < 8 && strlen(key.TYPE) > 0)
						break;
					printf("输入错误，请重新输入！\n");
					printf(LIGHT_CYAN"** 请输入机        型："NONE);
				}
				putchar(10);
				(void)My_replace_flight(head_flight,key,5);break;
			case 6:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:请输入您要修改的航班的起飞时间关键字信息，已进入管理员模式*************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要修改的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);				
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				//Input_flight_interface(&key);
				printf(LIGHT_CYAN"** 请输入起 飞  时 间："NONE);
				while(1){
					scanf("%ld",&key.stime);
					getchar();
					if(214748364 > key.stime&& key.stime >= 0)
						break;
					printf("输入错误，请重新输入！\n");
					printf(LIGHT_CYAN"** 请输入起 飞  时 间："NONE);
				}
				key.stime = time(NULL) + (key.stime * 60);	
				putchar(10);
				(void)My_replace_flight(head_flight,key,6);break;
			case 7:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:请输入您要修改的航班的到达时间关键字信息，已进入管理员模式*************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要修改的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);				
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				//Input_flight_interface(&key);
				printf(LIGHT_CYAN"** 请输入到 达  时 间："NONE);
				while(1){
					scanf("%ld",&key.atime);
					getchar();
					if(214748364 >key.atime && key.atime >= 0)
						break;
					printf("输入错误，请重新输入！\n");
					printf(LIGHT_CYAN"** 请输入到 达  时 间："NONE);
				}
				key.atime = (key.atime * 60) + time(NULL) + (key.stime * 60);	
				putchar(10);
				(void)My_replace_flight(head_flight,key,7);break;
			case 8:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:请输入您要修改的航班的票价关键字信息，已进入管理员模式*****************************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要修改的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);				
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				//Input_flight_interface(&key);
				printf(LIGHT_CYAN"** 请输入票        价："NONE);
				while(1){
					scanf("%d",&key.value);
					getchar();
					if(2147483647 >key.value && key.value >= 0)
						break;
					printf("输入错误，请重新输入！\n");
					printf(LIGHT_CYAN"** 请输入票        价："NONE);
				}	
				putchar(10);
				(void)My_replace_flight(head_flight,key,8);break;
			default:
				;
		}//end switch

	}	//end while for 	
}//end Modity_flight



void Show_flight(struct node* head_flight)
{
	char mode = '0';
	//struct flight input = {"","","","","",0,0,0,0,0,0};
	//struct passenger key = {"",0,input};
	//struct flight input;
	//memset(&input,0,sizeof(struct flight));
	struct flight key;
	memset(&key,0,sizeof(struct flight));
	while(1){
		system("clear");
		/***************************************************航班管理员图形界面设计**********************************************************************/
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_CYAN"*******************************************************************中国航班管理员模式**********************************************************************\n"NONE);
		printf(LIGHT_CYAN"**************************************************************Wecome to airline system*********************************************************************\n"NONE);
		printf(LIGHT_BLUE"**                                                     1.按剩余票数排序并显示航班信息                                                                    **\n"NONE);			
		printf(LIGHT_GRAY"**                                                     2.按起飞时间排序并显示航班信息                                                                    **\n"NONE);					
		printf(LIGHT_CYAN"**                                                     3.按到达时间排序并显示航班信息                                                                    **\n"NONE);	
		printf(LIGHT_GREEN"**                                                     4.按票价排序并显示航班信息                                                                        **\n"NONE);	
		printf(LIGHT_PURPLE"**                                                     5.默认显示                                                                                            **\n"NONE);			
		printf(LIGHT_RED"**                                                     6.退出                                                                                            **\n"NONE);	
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_CYAN"***************************************************温馨提示:当前位置为：显示排序，已进入管理员模式*********************************************************************\n"NONE);
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
		printf(LIGHT_RED"**请选择您要如何排序与显示："NONE);		
		mode = 0;
		while(1){
			scanf("%c",&mode);
			getchar();
			if(mode < '7' && mode> '0')
				break;
			printf("输入错误，请重新输入！\n");
			printf(LIGHT_CYAN"**请选择您要如何排序与显示："NONE);
		}
		if(mode == '6'){
			break;
		}
		switch(mode){
			case '1':
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:按剩余票数排序并显示航班信息，已进入管理员模式********************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				(void)Traverse_flight(head_flight,1);break;
			case '2':
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:按起飞时间排序并显示航班信息，已进入管理员模式********************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				(void)Traverse_flight(head_flight,2);break;
			case '3':
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:按到达时间排序并显示航班信息，已进入管理员模式********************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				(void)Traverse_flight(head_flight,3);break;
			case '4':
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:按票价排序并显示航班信息，已进入管理员模式************************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				(void)Traverse_flight(head_flight,4);break;
			case '5':
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:按默认显示航班信息，已进入管理员模式******************************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				(void)Traverse_flight(head_flight,5);break;
			default:
				;
		}//end switch
		sleep(2);
	}	//end while for	
}//end Show_flight


void Show_pasger(struct node_pasger* head_pasger)
{
	struct passenger pasger;
	struct node_pasger* pos = NULL;
	/***************************************************航班表输入图形界面设计**********************************************************************/
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	printf(LIGHT_CYAN"*******************************************************************中国航班--查询服务**********************************************************************\n"NONE);
	printf(LIGHT_CYAN"**************************************************************Wecome to airline system*********************************************************************\n"NONE);	
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);			
	printf(LIGHT_RED"*******************************************************查询成功!!,所有乘客信息如下*************************************************************************\n"NONE);
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	list_for_each_entry(pos,&head_pasger->list,list){
		printf(YELLOW"\t姓名\t身份证号\t航班号\t出发地点\t目地地点\t日期    \t机型      \t出发时间\t到达时间\t价格    \t总票数 \n"NONE);
		printf(RED"\t%s\t%d\t%s\t%s\t\t%s\t\t%s\t%s\t\t%ld\t\t%ld\t\t%d\t\t%d\t\n"NONE,pos->data.name,pos->data.ID,pos->data.fmsg.number,pos->data.fmsg.staddress,pos->data.fmsg.arraddress,pos->data.fmsg.DATE,pos->data.fmsg.TYPE,pos->data.fmsg.stime,pos->data.fmsg.atime,pos->data.fmsg.value,pos->data.fmsg.seat_size);
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	}
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	//printf(LIGHT_RED"**********************************************************************当前没有乘客订票*********************************************************************\n"NONE);			
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	getchar();
}//Show_pasger



void Check_flight(struct node* head_flight)
{
	int mode = 0;
	//struct flight input = {"","","","","",0,0,0,0,0,0};
	//struct passenger key = {"",0,input};
	//struct flight input;
	//memset(&input,0,sizeof(struct flight));
	struct flight key;
	memset(&key,0,sizeof(struct flight));
	while(1){
		system("clear");
		/***************************************************航班管理员图形界面设计**********************************************************************/
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_CYAN"*******************************************************************中国航班管理员模式**********************************************************************\n"NONE);
		printf(LIGHT_CYAN"**************************************************************Wecome to airline system*********************************************************************\n"NONE);
		printf(LIGHT_RED"**                                                     1.按航班号查找航班信息                                                                            **\n"NONE);	
		printf(LIGHT_BLUE"**                                                     2.按出发地点查找航班信息                                                                          **\n"NONE);	
		printf(LIGHT_CYAN"**                                                     3.按终点位置查找航班信息                                                                          **\n"NONE);	
		printf(LIGHT_GRAY"**                                                     4.按班期位置查找航班信息                                                                          **\n"NONE);	
		printf(LIGHT_CYAN"**                                                     5.按机型位置查找航班信息                                                                          **\n"NONE);			
		printf(LIGHT_PURPLE"**                                                     6.按起飞时间位置查找航班信息                                                                      **\n"NONE);					
		printf(LIGHT_CYAN"**                                                     7.按到达时间位置查找航班信息                                                                      **\n"NONE);	
		printf(LIGHT_GREEN"**                                                     8.按票价位置查找航班信息                                                                          **\n"NONE);	
		printf(LIGHT_RED"**                                                     9.退出                                                                                            **\n"NONE);			
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_CYAN"*************************************************温馨提示：当前为查找模式，已进入管理员模式****************************************************************\n"NONE);
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
		printf(LIGHT_BLUE"**请选择您的查找模式："NONE);		
		mode = 0;
		while(1){
			scanf("%d",&mode);
			getchar();
			if(mode < 12 && mode> 0)
				break;
			printf("输入错误，请重新输入！\n");
			printf(LIGHT_CYAN"**请选择您的查找模式："NONE);	
		}
		if(mode == 9){
			break;
		}
		switch(mode){
			case 1:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要查找的航班的航班号关键字信息，已进入管理员模式**********************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要查找的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Check_list_flight(head_flight,key,1);break;
			case 2:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要查找的航班的航班号关键字信息，已进入管理员模式**********************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要查找的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Check_list_flight(head_flight,key,2);break;
			case 3:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要查找的航班的航班号关键字信息，已进入管理员模式**********************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要查找的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Check_list_flight(head_flight,key,3);break;
			case 4:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要查找的航班的航班号关键字信息，已进入管理员模式**********************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要查找的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Check_list_flight(head_flight,key,4);break;
			case 5:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要查找的航班的航班号关键字信息，已进入管理员模式**********************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要查找的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Check_list_flight(head_flight,key,5);break;
			case 6:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要查找的航班的航班号关键字信息，已进入管理员模式**********************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要查找的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Check_list_flight(head_flight,key,6);break;
			case 7:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要查找的航班的航班号关键字信息，已进入管理员模式**********************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要查找的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Check_list_flight(head_flight,key,7);break;
			case 8:
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"********************************************温馨提示:请输入您要查找的航班的航班号关键字信息，已进入管理员模式**********************************************\n"NONE);
				printf(LIGHT_CYAN"***************************************温馨提示:只输入您要查找的关键字信息，其它信息可以任意填入，已进入管理员模式*****************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Input_flight_interface(&key);
				(void)Check_list_flight(head_flight,key,8);break;
			default:
				;
		}//end switch
		getchar();
	}	//end while for 		
}//end Check_flight


void Check_ticket(struct node_pasger* head_pasger)
{
	struct passenger pasger;
	struct node_pasger* pos = NULL;
	/***************************************************航班表输入图形界面设计**********************************************************************/
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	printf(LIGHT_CYAN"*******************************************************************中国航班--查询服务**********************************************************************\n"NONE);
	printf(LIGHT_CYAN"**************************************************************Wecome to airline system*********************************************************************\n"NONE);
	printf(LIGHT_CYAN"** 请输入姓        名："NONE);
	while(1){
		scanf("%s",pasger.name);
		getchar();
		if(strlen(pasger.name) < 18 && strlen(pasger.name) > 0 )
			break;
		printf("输入错误，请重新输入！\n");
		printf(LIGHT_CYAN"** 请输入姓        名："NONE);
	}
	putchar(10);
	printf(LIGHT_CYAN"** 请输入身份    证号："NONE);
	while(1){
		scanf("%d",&pasger.ID);
		getchar();
		if( pasger.ID > 0 && pasger.ID <2147483647)
			break;
		printf("输入错误，请重新输入！\n");
		printf(LIGHT_CYAN"** 请输入身份    证号："NONE);
	}
	putchar(10);	
	list_for_each_entry(pos,&head_pasger->list,list){
		if((strcmp(pos->data.name,pasger.name) == 0)&&(pos->data.ID == pasger.ID)){
			printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);			
			printf(LIGHT_GREEN"*******************************************************查询成功!!,您的订票信息如下*************************************************************************\n"NONE);
			printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
			printf(YELLOW"\t姓名\t身份证号\t航班号\t出发地点\t目地地点\t日期    \t机型      \t出发时间\t到达时间\t价格    \t总票数 \n"NONE);
			printf(RED"\t%s\t%d\t%s\t%s\t\t%s\t\t%s\t%s\t\t%ld\t\t%ld\t\t%d\t\t%d\t\n"NONE,pos->data.name,pos->data.ID,pos->data.fmsg.number,pos->data.fmsg.staddress,pos->data.fmsg.arraddress,pos->data.fmsg.DATE,pos->data.fmsg.TYPE,pos->data.fmsg.stime,pos->data.fmsg.atime,pos->data.fmsg.value,pos->data.fmsg.seat_size);
			printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
			getchar();
			return;
		}
	}
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	printf(LIGHT_RED"*******************查询失败:所有航班中没有找到您要查找的航班信息，请检查您的输入是否正确，或到航班前台查询*************************************************\n"NONE);			
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	getchar();
}//end Check_ticket


void Ticket_changing(struct node* head_flight,struct node_pasger* head_pasger)
{
	struct passenger pasger;
	struct node_pasger* pos = NULL;
	char yesno[6];
	/***************************************************航班表输入图形界面设计**********************************************************************/
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	printf(LIGHT_CYAN"*******************************************************************中国航班--退票服务**********************************************************************\n"NONE);
	printf(LIGHT_CYAN"**************************************************************Wecome to airline system*********************************************************************\n"NONE);
	printf(LIGHT_CYAN"** 请输入姓        名："NONE);
	while(1){
		scanf("%s",pasger.name);
		getchar();
		if(strlen(pasger.name) < 18 && strlen(pasger.name) > 0 )
			break;
		printf("输入错误，请重新输入！\n");
		printf(LIGHT_CYAN"** 请输入姓        名："NONE);
	}
	putchar(10);
	printf(LIGHT_CYAN"** 请输入身份    证号："NONE);
	while(1){
		scanf("%d",&pasger.ID);
		getchar();
		if( pasger.ID > 0 && pasger.ID <2147483647)
			break;
		printf("输入错误，请重新输入！\n");
		printf(LIGHT_CYAN"** 请输入身份    证号："NONE);
	}
	putchar(10);	
	list_for_each_entry(pos,&head_pasger->list,list){
		if((strcmp(pos->data.name,pasger.name) == 0)&&(pos->data.ID == pasger.ID)){
			printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);			
			printf(LIGHT_GREEN"*******************************************************查询成功!!,您的订票信息如下*************************************************************************\n"NONE);
			printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
			printf(YELLOW"\t姓名\t身份证号\t航班号\t出发地点\t目地地点\t日期    \t机型      \t出发时间\t到达时间\t价格    \t总票数 \n"NONE);
			printf(RED"\t%s\t%d\t%s\t%s\t\t%s\t\t%s\t%s\t\t%ld\t\t%ld\t\t%d\t\t%d\t\n"NONE,pos->data.name,pos->data.ID,pos->data.fmsg.number,pos->data.fmsg.staddress,pos->data.fmsg.arraddress,pos->data.fmsg.DATE,pos->data.fmsg.TYPE,pos->data.fmsg.stime,pos->data.fmsg.atime,pos->data.fmsg.value,pos->data.fmsg.seat_size);
			printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);

			printf(LIGHT_RED"**是否改签该航班信息(yes or no)："NONE);
			while(1){
				scanf("%s",yesno);
				getchar();
				if(strlen(yesno) < 7 && strlen(yesno)> 0)
					break;
				printf("输入错误，请重新输入！\n");
				printf(LIGHT_RED"**是否改签该航班信息："NONE);
			}//end while
			if(strcmp(yesno,"yes") == 0){
				__list_del(pos->list.prev,pos->list.next);
				//list_del(&pos->list);
				free(pos);
				pos = NULL;
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_RED"********************************************退票成功，感谢您的使用，已进入用户模式*************************************************************************\n"NONE);			
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Book_ticket(head_flight,head_pasger);	
				getchar();
				return;
			}//end if yes									
		}
	}
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	printf(LIGHT_CYAN"*******************查询失败:所有航班中没有找到您要查找的航班信息，请检查您的输入是否正确，或到航班前台查询*************************************************\n"NONE);			
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	getchar();
}//end Ticket_changing

void Refund_ticket(struct node_pasger* head_pasger)
{
	struct passenger pasger;
	struct node_pasger* pos = NULL;
	char yesno[6];
	/***************************************************航班表输入图形界面设计**********************************************************************/
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	printf(LIGHT_CYAN"*******************************************************************中国航班--退票服务**********************************************************************\n"NONE);
	printf(LIGHT_CYAN"**************************************************************Wecome to airline system*********************************************************************\n"NONE);
	printf(LIGHT_CYAN"** 请输入姓        名："NONE);
	while(1){
		scanf("%s",pasger.name);
		getchar();
		if(strlen(pasger.name) < 18 && strlen(pasger.name) > 0 )
			break;
		printf("输入错误，请重新输入！\n");
		printf(LIGHT_CYAN"** 请输入姓        名："NONE);
	}
	putchar(10);
	printf(LIGHT_CYAN"** 请输入身份    证号："NONE);
	while(1){
		scanf("%d",&pasger.ID);
		getchar();
		if( pasger.ID > 0 && pasger.ID <2147483647)
			break;
		printf("输入错误，请重新输入！\n");
		printf(LIGHT_CYAN"** 请输入身份    证号："NONE);
	}
	putchar(10);	
	list_for_each_entry(pos,&head_pasger->list,list){
		if((strcmp(pos->data.name,pasger.name) == 0)&&(pos->data.ID == pasger.ID)){
			printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);			
			printf(LIGHT_RED"*******************************************************查询成功!!,您的订票信息如下*************************************************************************\n"NONE);
			printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
			printf(YELLOW"\t姓名\t身份证号\t航班号\t出发地点\t目地地点\t日期    \t机型      \t出发时间\t到达时间\t价格    \t总票数 \n"NONE);
			printf(RED"\t%s\t%d\t%s\t%s\t\t%s\t\t%s\t%s\t\t%ld\t\t%ld\t\t%d\t\t%d\t\n"NONE,pos->data.name,pos->data.ID,pos->data.fmsg.number,pos->data.fmsg.staddress,pos->data.fmsg.arraddress,pos->data.fmsg.DATE,pos->data.fmsg.TYPE,pos->data.fmsg.stime,pos->data.fmsg.atime,pos->data.fmsg.value,pos->data.fmsg.seat_size);
			printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);

			printf(LIGHT_RED"**是否删除该航班信息(yes or no)："NONE);
			while(1){
				scanf("%s",yesno);
				getchar();
				if(strlen(yesno) < 7 && strlen(yesno)> 0)
					break;
				printf("输入错误，请重新输入！\n");
				printf(LIGHT_CYAN"**是否删除该航班信息："NONE);
			}//end while
			if(strcmp(yesno,"yes") == 0){
				__list_del(pos->list.prev,pos->list.next);
				//list_del(&pos->list);
				free(pos);
				pos = NULL;
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_RED"********************************************退票成功，感谢您的使用，已进入用户模式*************************************************************************\n"NONE);			
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				getchar();
				return;
			}//end if yes									
		}
	}
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	printf(LIGHT_CYAN"*******************查询失败:所有航班中没有找到您要查找的航班信息，请检查您的输入是否正确，或到航班前台查询*************************************************\n"NONE);			
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	getchar();

}//end Refund_ticket


int Seat_show(struct node_pasger* head_pasger,char* number)
{
	struct node_pasger* pos = NULL;
	int count = 0;
	int b[1000];
	int seat_size =0;
	int i,r,c,m,n,r_max,seat_left;
	//初始化b[1000]
	for(i =0;i<1000;i++){
		b[i] = 0;
	}
	/***************************************************航班表图形登录界面设计**********************************************************************/
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	printf(LIGHT_CYAN"*******************************************************************中国航班系统****************************************************************************\n"NONE);
	printf(LIGHT_CYAN"**************************************************************Wecome to airline system*********************************************************************\n"NONE);
	printf(LIGHT_BLUE"**                                                 温馨提示：请选择您的位置；                                                                            **\n"NONE);
	printf(LIGHT_GRAY"**                                               1.0表示该座位为空，若有座位数说明已经有人预订。                                                         **\n"NONE);
	printf(LIGHT_PURPLE"**                                               2.输入行选择座位的行；                                                                                  **\n"NONE);
	printf(LIGHT_GREEN"**                                               3.输入列选择座位的列；                                                                                  **\n"NONE);
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
	printf(LIGHT_RED"*************     列1     ******************************    列2      **过           道*******     列3   ***************************       列4   ***********\n"NONE);
	//遍历所有乘客，把相同航班号的座位号取出
	list_for_each_entry(pos,&head_pasger->list,list){
		if((strcmp(pos->data.fmsg.number,number) == 0)){
			b[count++]=pos->data.fmsg.seat_left;
			r_max = pos->data.fmsg.seat_size;
			//printf("this seat is full!\n");
		}//end if
	}
	if(count == 0){
		r_max = 500;
	}
	int a[500][4];
	for(r =0; r <500;r++){
		for(c=0;c <4;c++){
			a[r][c] = 0;
			//printf("\t\ta[%d][%d]=%d\t\t",r,c,a[r][c]);
		}
		//putchar(10);
	}
	int tmp;
	for(i=0;i<count;i++){
		tmp = b[i];
		//printf("b[%d] = %d ;",i,b[i]);
		m = (tmp%4)-1;
		if(m < 0){
			m = 0;
		}
		n = (int)(tmp/4);
		a[n][m] = tmp;
		//printf("a[%d][%d] = %d ; ",n,m,a[n][m]);
		//putchar(10);
	}
	for(r =0; r <r_max;r++){
		for(c=0;c <4;c++){

			if(a[r][c] !=0){
				printf(RED"行%d\t\ta[%d][%d]=%d\t\t"NONE,r+1,r,c,a[r][c]);//打印座位表
			}else{
				printf(YELLOW"行%d\t\ta[%d][%d]=%d\t\t"NONE,r+1,r,c,a[r][c]);//打印座位表
			}
		}
		putchar(10);
	}
	int col,row;
	printf(LIGHT_CYAN"** 请输入座位列号："NONE);
	while(1){
		scanf("%d",&col);
		getchar();
		if(col < 5 && col > 0 )
			break;
		printf("输入错误，请重新输入！\n");
		printf(LIGHT_CYAN"** 请输入座位列号："NONE);
	}
	putchar(10);
	printf(LIGHT_CYAN"** 请输入座位行号："NONE);
	while(1){
		scanf("%d",&row);
		getchar();
		if( row> 0 && row <r_max)//without seat_size
			break;
		printf("输入错误，请重新输入！\n");
		printf(LIGHT_CYAN"** 请输入座位行号："NONE);
	}
	putchar(10);		
	seat_left = col + (row-1) * 4 ; 
	return seat_left;
}//Seat_show


void Book_ticket(struct node* head_flight,struct node_pasger* head_pasger)
{
	struct node *pos = NULL;
	char mode = '0';
	char number[18];
	struct passenger pasger;
	while(1){
		system("clear");
		/***************************************************航班管理员图形界面设计**********************************************************************/
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_CYAN"*******************************************************************中国航班-订票服务***********************************************************************\n"NONE);
		printf(LIGHT_CYAN"**************************************************************Wecome to airline system*********************************************************************\n"NONE);
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);

		printf(LIGHT_PURPLE"**                                                     1.显示航班信息                                                                                    **\n"NONE);			
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_BLUE"**                                                     2.查找航班信息                                                                                    **\n"NONE);					
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_GREEN"**                                                     3.添加行程                                                                                        **\n"NONE);				
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_RED"**                                                     4.退出                                                                                            **\n"NONE);	
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
		printf(LIGHT_CYAN"***************************************************温馨提示:当前位置为：显示排序，已进入管理员模式*********************************************************\n"NONE);
		printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
		printf(LIGHT_RED"**请选择您要进程的操作："NONE);		

		while(1){
			scanf("%c",&mode);
			getchar();
			if(mode < '5' && mode> '0')
				break;
			printf("输入错误，请重新输入！\n");
			printf(LIGHT_RED"**请选择您要进程的操作："NONE);
		}
		if(mode == '4'){
			break;
		}
		switch(mode){
			case '1':
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"******************************************************温馨提示:显示航班信息，已进入用户模式****************************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Show_flight(head_flight);break;
			case '2':
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"******************************************************温馨提示:查找航班信息，已进入用户模式****************************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				Check_flight(head_flight);break;
			case '3':
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"****************************************************温馨提示:根据航班信息添加行程，已进入用户模式**********************************************************\n"NONE);
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_CYAN"**请输入您要搭乘的航班号（如不清楚请输入quit返回选择查找）："NONE);		

				while(1){
					scanf("%s",number);
					getchar();
					if(strlen(number) < 18 && strlen(number)> 0)
						break;
					printf("输入错误，请重新输入！\n");
					printf(LIGHT_BLUE"**请输入您要搭乘的航班号（如不清楚请输入quit返回选择查找）："NONE);
				}
				list_for_each_entry(pos,&head_flight->list,list){
					if(strcmp(pos->data.number,number) == 0){
						printf(YELLOW"\t航班号\t出发地点\t目地地点\t日期    \t机型      \t出发时间\t到达时间\t价格    \t总票数  \t余票 \n"NONE);					
						printf(RED"\t%s\t%s\t\t%s\t\t%s\t%s\t\t%ld\t\t%ld\t\t%d\t\t%d\t\t%d\n"NONE,pos->data.number,pos->data.staddress,pos->data.arraddress,pos->data.DATE,pos->data.TYPE,pos->data.stime,pos->data.atime,pos->data.value,pos->data.seat_size,pos->data.poll);
						printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
						printf(LIGHT_CYAN"******************************************************************************开始订票*********************************************************************\n"NONE);						
						printf(LIGHT_CYAN"**************************************************************************请按提示输入信息*****************************************************************\n"NONE);
						printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);						

						strcpy(pasger.fmsg.number,pos->data.number);
						strcpy(pasger.fmsg.staddress,pos->data.staddress);
						strcpy(pasger.fmsg.arraddress,pos->data.arraddress);
						strcpy(pasger.fmsg.DATE,pos->data.DATE);
						strcpy(pasger.fmsg.TYPE,pos->data.TYPE);
						pasger.fmsg.value = pos->data.value;
						pasger.fmsg.seat_size = pos->data.seat_size;

						pos->data.poll--;//余票减一

						pasger.fmsg.stime = pos->data.stime;
						pasger.fmsg.atime = pos->data.atime;


						pasger.fmsg.seat_left=Seat_show(head_pasger,number);//选择座位号

						printf(LIGHT_CYAN"** 请输入姓        名："NONE);
						while(1){
							scanf("%s",pasger.name);
							getchar();
							if(strlen(pasger.name) < 18 && strlen(pasger.name) > 0 )
								break;
							printf("输入错误，请重新输入！\n");
							printf(LIGHT_CYAN"** 请输入姓        名："NONE);
						}
						putchar(10);
						printf(LIGHT_CYAN"** 请输入身份    证号："NONE);
						while(1){
							scanf("%d",&pasger.ID);
							getchar();
							if( pasger.ID > 0 && pasger.ID <2147483647)
								break;
							printf("输入错误，请重新输入！\n");
							printf(LIGHT_CYAN"** 请输入身份    证号："NONE);
						}
						putchar(10);						
						//把该乘客添加到链表中

						(void)Insert_data_pasger(head_pasger, &pasger,pasger,0);

						printf(LIGHT_CYAN"******************************************************************************订票成功*********************************************************************\n"NONE);						
						printf(LIGHT_GREEN"******************************************************************************订票成功*********************************************************************\n"NONE);						
						printf(LIGHT_RED"***************************************************************欢迎您选择本次航班，祝您旅行愉快************************************************************\n"NONE);
						printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);	
						getchar();
						return;
					}//end if number
				}//end list_for_each_entry
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				printf(LIGHT_RED"**************************查找失败:所有航班中没有找到您要查找的航班信息，已进入用户模式********************************************************************\n"NONE);			
				printf(LIGHT_CYAN"***********************************************************************************************************************************************************\n"NONE);
				break;				

			default:
				;
		}//end switch

	}	//end while for	

}//end Book_ticket


void RW_file_init(struct node *flight_head,struct node_pasger *pasger_head,int mode)
{
	struct node *pos1 = NULL;
	struct node_pasger *pos2 = NULL;
	struct node *pos3 = NULL;
	struct node_pasger *pos4 = NULL;
	struct node pos5;
	struct node_pasger pos6;
	FILE* fp1;
	FILE* fp2;
	struct stat sb; 
	switch(mode){
		case 1://W
			fp1 = fopen("./flight.txt","w+");
			fp2 = fopen("./pasger.txt","w+");

			list_for_each_entry(pos1,&flight_head->list,list){
				fprintf(fp1,"%s %s %s %s %s %ld %ld %d %d %d\n",pos1->data.number,pos1->data.staddress,pos1->data.arraddress,pos1->data.DATE,pos1->data.TYPE,pos1->data.stime,pos1->data.atime,pos1->data.value,pos1->data.seat_size,pos1->data.poll);
			};

			list_for_each_entry(pos2,&pasger_head->list,list){
					fprintf(fp2,"%s %d %s %s %s %s %s %ld %ld %d %d\n",pos2->data.name,pos2->data.ID,pos2->data.fmsg.number,pos2->data.fmsg.staddress,pos2->data.fmsg.arraddress,pos2->data.fmsg.DATE,pos2->data.fmsg.TYPE,pos2->data.fmsg.stime,pos2->data.fmsg.atime,pos2->data.fmsg.value,pos2->data.fmsg.poll);
			};		
			break;
		case 2://R
			fp1 = fopen("./flight.txt","r");
			fp2 = fopen("./pasger.txt","r");

			if (stat("./flight.txt", &sb) == -1) {
				perror("stat");
				exit(-1);
			}   
			printf("flight File size:                %lld bytes\n",(long long) sb.st_size);
			if(sb.st_size > 0){ 
				while(1){//Read fligh msg to list flight
					fscanf(fp1,"%s %s %s %s %s %ld %ld %d %d %d\n",pos5.data.number,pos5.data.staddress,pos5.data.arraddress,pos5.data.DATE,pos5.data.TYPE,&pos5.data.stime,&pos5.data.atime,&pos5.data.value,&pos5.data.seat_size,&pos5.data.poll);
					pos3 = (struct node*)malloc(sizeof(struct node));
					if(!pos3){
						perror("");
						exit(-1);
					}
					strcpy(pos3->data.number,pos5.data.number);
					strcpy(pos3->data.staddress,pos5.data.staddress);
					strcpy(pos3->data.arraddress,pos5.data.arraddress);
					strcpy(pos3->data.DATE,pos5.data.DATE);
					strcpy(pos3->data.TYPE,pos5.data.TYPE);

					pos3->data.stime = pos5.data.stime;
					pos3->data.atime = pos5.data.atime;
					pos3->data.value = pos5.data.value;
					pos3->data.seat_size = pos5.data.seat_size;
					pos3->data.poll = pos5.data.poll;
					INIT_LIST_HEAD(&pos3->list);
					list_add_tail(&pos3->list,&flight_head->list);				
					if(feof(fp1))
						break;
				}//end while
			}else{
				printf("flight file is empty!\n");
			} //end read flight

			if (stat("./pasger.txt", &sb) == -1) {
				perror("stat");
				exit(-1);
			}   
			printf("pasger File size:                %lld bytes\n",(long long) sb.st_size);
			if(sb.st_size > 0){ 
				while(1){//Read pasger msg to list pasger

					fscanf(fp2,"%s %d %s %s %s %s %s %ld %ld %d %d\n",pos6.data.name,&pos6.data.ID,pos6.data.fmsg.number,pos6.data.fmsg.staddress,pos6.data.fmsg.arraddress,pos6.data.fmsg.DATE,pos6.data.fmsg.TYPE,&pos6.data.fmsg.stime,&pos6.data.fmsg.atime,&pos6.data.fmsg.value,&pos6.data.fmsg.poll);
					pos4 = (struct node_pasger*)malloc(sizeof(struct node_pasger));
					if(!pos4){
						perror("");
						exit(-1);
					}
					strcpy(pos4->data.name,pos6.data.name);
					strcpy(pos4->data.fmsg.number,pos6.data.fmsg.number);
					strcpy(pos4->data.fmsg.staddress,pos6.data.fmsg.staddress);
					strcpy(pos4->data.fmsg.arraddress,pos6.data.fmsg.arraddress);
					strcpy(pos4->data.fmsg.DATE,pos6.data.fmsg.DATE);
					strcpy(pos4->data.fmsg.TYPE,pos6.data.fmsg.TYPE);

					pos4->data.ID = pos6.data.ID;
					pos4->data.fmsg.stime = pos6.data.fmsg.stime;
					pos4->data.fmsg.atime = pos6.data.fmsg.atime;
					pos4->data.fmsg.value = pos6.data.fmsg.value;
					//pos4->data.seat_size = pos6.data.seat_size;
					pos4->data.fmsg.poll = pos6.data.fmsg.poll;
					INIT_LIST_HEAD(&pos4->list);
					list_add_tail(&pos4->list,&pasger_head->list);				
					if(feof(fp2))
						break;


				}//end while
			}else{
				printf("pasger file is empty!\n");
			}//end read pasger
			break;
	}//end switch

	fclose(fp1);
	fclose(fp2);
}//end RW_file_init


